# Inequality Operator

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleFieldId..::..Inequality Operator
ScheduleFieldId Class See Also
---
Determines whether two ScheduleFieldId are different.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static bool operator !=(
	ScheduleFieldId first,
	ScheduleFieldId second
)
```

Visual Basic
---
```text
Public Shared Operator <> ( _
	first As ScheduleFieldId, _
	second As ScheduleFieldId _
) As Boolean
```

Visual C++
---
```text
public:
static bool operator !=(
	ScheduleFieldId^ first,
	ScheduleFieldId^ second
)
```

# ### Parameters
first
    Type: Autodesk.Revit.DB..::..ScheduleFieldIdThe first ScheduleFieldId.
second
    Type: Autodesk.Revit.DB..::..ScheduleFieldIdThe second ScheduleFieldId.
# ### Return Value
True if the ScheduleFieldId are different, otherwise false.
# See Also
ScheduleFieldId Class
Autodesk.Revit.DB Namespace